apache/nuttx/arch/arm/src/imxrt/imxrt_flexcan.c
#ifdef CONFIG_NET_CAN_RAW_TX_DEADLINE
#define TX_ABORT -1
#define TX_FREE 0
#define TX_BUSY 1

struct txmbstats
{
  struct timeval deadline;
  uint32_t pending; /* -1 = abort, 0 = free, 1 = busy  */
};
#endif

/* FlexCAN Device hardware configuration */

struct flexcan_config_s
{
  uint32_t tx_pin;           /* GPIO configuration for TX */
  uint32_t rx_pin;           /* GPIO configuration for RX */
  uint32_t irq;              /* Combined interrupt */
};

struct flexcan_timeseg
{
  uint32_t bitrate;
  int32_t samplep;
  uint8_t propseg;
  uint8_t pseg1;
  uint8_t pseg2;
  uint8_t presdiv;
};

/* FlexCAN device structures */

#ifdef CONFIG_IMXRT_FLEXCAN1
static const struct flexcan_config_s imxrt_flexcan1_config =
{
  .tx_pin      = GPIO_FLEXCAN1_TX,
  .rx_pin      = GPIO_FLEXCAN1_RX,
  .irq         = IMXRT_IRQ_CAN1,
};
#endif

#ifdef CONFIG_IMXRT_FLEXCAN2
static const struct flexcan_config_s imxrt_flexcan2_config =
{
  .tx_pin      = GPIO_FLEXCAN2_TX,
  .rx_pin      = GPIO_FLEXCAN2_RX,
  .irq         = IMXRT_IRQ_CAN2,
};
#endif

#ifdef CONFIG_IMXRT_FLEXCAN3
static const struct flexcan_config_s imxrt_flexcan3_config =
{
  .tx_pin      = GPIO_FLEXCAN3_TX,
  .rx_pin      = GPIO_FLEXCAN3_RX,
  .irq         = IMXRT_IRQ_CAN3,
};
#endif

/* The imxrt_driver_s encapsulates all state information for a single
 * hardware interface
 */

struct imxrt_driver_s
{
  uint32_t base;                /* FLEXCAN base address */
  bool bifup;                   /* true:ifup false:ifdown */
  bool canfd_capable;
  int mb_address_offset;
  spinlock_t lock;
#ifdef TX_TIMEOUT_WQ
  struct wdog_s txtimeout[TXMBRINGSIZE]; /* TX timeout timer */
#endif
  struct work_s rcvwork;            /* For deferring interrupt work to the wq */
  struct work_s irqwork;            /* For deferring interrupt work to the wq */
  struct work_s pollwork;           /* For deferring poll work to the work wq */
  struct canfd_frame *txdesc_fd;    /* A pointer to the list of TX descriptor for FD frames */
  struct canfd_frame *rxdesc_fd;    /* A pointer to the list of RX descriptors for FD frames */
  struct can_frame *txdesc;         /* A pointer to the list of TX descriptor */
  struct can_frame *rxdesc;         /* A pointer to the list of RX descriptors */

  /* This holds the information visible to the NuttX network */

  struct net_driver_s dev;      /* Interface understood by the network */

  struct flexcan_timeseg arbi_timing; /* Timing for arbitration phase */
  struct flexcan_timeseg data_timing; /* Timing for data phase */

  const struct flexcan_config_s *config;

#ifdef CONFIG_NET_CAN_RAW_TX_DEADLINE
  struct txmbstats txmb[TXMBRINGSIZE];
#endif
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_IMXRT_FLEXCAN1
static struct imxrt_driver_s g_flexcan1;
#endif

#ifdef CONFIG_IMXRT_FLEXCAN2
static struct imxrt_driver_s g_flexcan2;
#endif

#ifdef CONFIG_IMXRT_FLEXCAN3
static struct imxrt_driver_s g_flexcan3;
#endif

#ifdef CONFIG_NET_CAN_CANFD
static uint8_t g_tx_pool[(sizeof(struct canfd_frame)+MSG_DATA)*POOL_SIZE];
static uint8_t g_rx_pool[(sizeof(struct canfd_frame)+MSG_DATA)*POOL_SIZE];
#else
static uint8_t g_tx_pool[sizeof(struct can_frame)*POOL_SIZE];
static uint8_t g_rx_pool[sizeof(struct can_frame)*POOL_SIZE];
#endif

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/****************************************************************************
 * Name: arm_lsb
 *
 * Description:
 *   Calculate position of lsb that's equal to 1
 *
 * Input Parameters:
 *   value - The value to perform the operation on
 *
 * Returned Value:
 *   location of lsb which is equal to 1, returns 32 when value is 0
 *
 ****************************************************************************/

static inline uint32_t arm_lsb(unsigned int value)
{
  uint32_t ret;
  volatile uint32_t rvalue = value;
  __asm__ __volatile__ ("rbit %1,%0" : "=r" (rvalue) : "r" (rvalue));
  __asm__ __volatile__ ("clz %0, %1" : "=r"(ret) : "r"(rvalue));
  return ret;
}

/****************************************************************************
 * Name: imxrt_bitratetotimeseg
 *
 * Description:
 *   Convert bitrate to timeseg
 *
 * Input Parameters:
 *   timeseg - structure to store bit timing
 *   sp_tolerance - allowed difference in sample point from calculated
 *                  bit timings (recommended value: 1)
 *   can_fd - if set to calculate CAN FD bit timings, otherwise calculate
 *            classical can timings
 *
 * Returned Value:
 *   return 1 on success, return 0 on failure
 *
 ****************************************************************************/

uint32_t imxrt_bitratetotimeseg(struct flexcan_timeseg *timeseg,
                                                int32_t sp_tolerance,
                                                uint32_t can_fd)
{
  int32_t tmppresdiv;
  int32_t numtq;
  int32_t tmpsample;
  int32_t tseg1;
  int32_t tseg2;
  int32_t tmppseg1;
  int32_t tmppseg2;
  int32_t tmppropseg;

  const int32_t TSEG1MAX = (can_fd ? TSEG1_FD_MAX : TSEG1_MAX);
  const int32_t TSEG2MAX = (can_fd ? TSEG2_FD_MAX : TSEG2_MAX);
  const int32_t SEGMAX = (can_fd ? SEG_FD_MAX : SEG_MAX);
  const int32_t NUMTQMAX = (can_fd ? NUMTQ_FD_MAX : NUMTQ_MAX);

  for (tmppresdiv = 0; tmppresdiv < PRESDIV_MAX; tmppresdiv++)
    {
      numtq = (CLK_FREQ / ((tmppresdiv + 1) * timeseg->bitrate));

      if (numtq == 0)
        {
          continue;
        }

      /* The number of time quanta in 1 bit time must be
       * lower than the one supported
       */

      if ((CLK_FREQ / ((tmppresdiv + 1) * numtq) == timeseg->bitrate)
          && (numtq >= 8) && (numtq < NUMTQMAX))
        {
          /* Compute time segments based on the value of the sampling point */

          tseg1 = (numtq * timeseg->samplep / 100) - 1;
          tseg2 = numtq - 1 - tseg1;

          /* Adjust time segment 1 and time segment 2 */

