apache/nuttx/arch/arm/src/imxrt/imxrt_flexcan.c
          while (tseg1 >= TSEG1MAX || tseg2 < TSEG_MIN)
            {
              tseg2++;
              tseg1--;
            }

          tmppseg2 = tseg2 - 1;

          /* Start from pseg1 = pseg2 and adjust until propseg is valid */

          tmppseg1 = tmppseg2;
          tmppropseg = tseg1 - tmppseg1 - 2;

          while (tmppropseg <= 0)
            {
              tmppropseg++;
              tmppseg1--;
            }

          while (tmppropseg >= SEGMAX)
            {
              tmppropseg--;
              tmppseg1++;
            }

          if (((tseg1 >= TSEG1MAX) || (tseg2 >= TSEG2MAX) ||
              (tseg2 < TSEG_MIN) || (tseg1 < TSEG_MIN)) ||
              ((tmppropseg >= SEGMAX) || (tmppseg1 >= SEGMAX) ||
                  (tmppseg2 < SEG_MIN) || (tmppseg2 >= SEGMAX)))
            {
              continue;
            }

          tmpsample = ((tseg1 + 1) * 100) / numtq;

          if ((tmpsample - timeseg->samplep) <= sp_tolerance &&
              (timeseg->samplep - tmpsample) <= sp_tolerance)
            {
              if (can_fd == 1)
                {
                  timeseg->propseg = tmppropseg + 1;
                }
              else
                {
                  timeseg->propseg = tmppropseg;
                }
              timeseg->pseg1 = tmppseg1;
              timeseg->pseg2 = tmppseg2;
              timeseg->presdiv = tmppresdiv;
              timeseg->samplep = tmpsample;
              return 1;
            }
        }
    }

  return 0;
}

/* Common TX logic */

static bool imxrt_txringfull(struct imxrt_driver_s *priv);
static int  imxrt_transmit(struct imxrt_driver_s *priv);
static int  imxrt_txpoll(struct net_driver_s *dev);

/* Helper functions */

static void imxrt_setenable(uint32_t base, uint32_t enable);
static void imxrt_setfreeze(uint32_t base, uint32_t freeze);
static uint32_t imxrt_waitmcr_change(uint32_t base,
                                       uint32_t mask,
                                       uint32_t target_state);
static struct mb_s *flexcan_get_mb(struct imxrt_driver_s *priv,
                                    uint32_t mbi);

/* Interrupt handling */

static void imxrt_receive(struct imxrt_driver_s *priv,
                            uint32_t flags);
static void imxrt_txdone_work(void *arg);
static void imxrt_txdone(struct imxrt_driver_s *priv);

static int  imxrt_flexcan_interrupt(int irq, void *context,
                                      void *arg);
static void imxrt_flexcan_interrupt_work(void *arg);

/* Watchdog timer expirations */
#ifdef TX_TIMEOUT_WQ
static void imxrt_txtimeout_work(void *arg);
static void imxrt_txtimeout_expiry(wdparm_t arg);
#endif

/* NuttX callback functions */

static int  imxrt_ifup(struct net_driver_s *dev);
static int  imxrt_ifdown(struct net_driver_s *dev);

static void imxrt_txavail_work(void *arg);
static int  imxrt_txavail(struct net_driver_s *dev);

#ifdef CONFIG_NETDEV_IOCTL
static int  imxrt_ioctl(struct net_driver_s *dev, int cmd,
                          unsigned long arg);
#endif

/* Initialization */

static int  imxrt_initialize(struct imxrt_driver_s *priv);
static void imxrt_reset(struct imxrt_driver_s *priv);

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Function: imxrt_txmb_next
 *
 * Description:
 *   Pick the mailbox to load the next frame into.
 *
 *   Every frame of a multi-frame transport transfer carries the same CAN
 *   ID, and FlexCAN breaks an arbitration tie between mailboxes holding
 *   equal IDs by taking the lowest mailbox number.  Handing out the
 *   lowest *free* mailbox therefore lets a frame loaded into a
 *   just-drained low mailbox win arbitration against older frames still
 *   pending in higher ones, and the receiver sees the transfer out of
 *   order.
 *
 *   Only ever hand out a mailbox above every pending one, and wrap back to
 *   the bottom once the ring has drained.
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   The mailbox index to use, or TOTALMBCOUNT if none is available.
 *
 ****************************************************************************/

static uint32_t imxrt_txmb_next(struct imxrt_driver_s *priv)
{
  uint32_t mbi  = RXMBCOUNT + 1;
  uint32_t next = RXMBCOUNT + 1;

  while (mbi < TOTALMBCOUNT)
    {
      struct mb_s *mb = flexcan_get_mb(priv, mbi);

      if (mb->cs.code == CAN_TXMB_DATAORREMOTE)
        {
          next = mbi + 1;
        }

      mbi++;
    }

  return next;
}

/****************************************************************************
 * Function: imxrt_txringfull
 *
 * Description:
 *   Check if all of the TX descriptors are in use.
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   true is the TX ring is full; false if there are free slots at the
 *   head index.
 *
 ****************************************************************************/

static bool imxrt_txringfull(struct imxrt_driver_s *priv)
{
  return imxrt_txmb_next(priv) >= TOTALMBCOUNT;
}

/****************************************************************************
 * Function: imxrt_transmit
 *
 * Description:
 *   Start hardware transmission.  Called either from the txdone interrupt
 *   handling or from watchdog based polling.
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 * Assumptions:
 *   May or may not be called from an interrupt handler.  In either case,
 *   global interrupts are disabled, either explicitly or indirectly through
 *   interrupt handling logic.
 *
 ****************************************************************************/

static int imxrt_transmit(struct imxrt_driver_s *priv)
{
  /* Attempt to write frame */

  uint32_t mbi = 0;
  uint32_t mb_bit;
  uint32_t regval;
#ifdef CONFIG_NET_CAN_CANFD
  uint32_t *frame_data_word;
  uint32_t i;
#endif
#ifdef CONFIG_NET_CAN_RAW_TX_DEADLINE
  int32_t timeout;
  uint32_t txmb = 0;
#endif

  mbi = imxrt_txmb_next(priv);

  if (mbi >= TOTALMBCOUNT)
    {
      nwarn("No TX MB available mbi %" PRIi32 "\n", mbi);
      NETDEV_TXERRORS(&priv->dev);
      return 0;       /* No transmission for you! */
    }

  mb_bit = 1 << mbi;
  putreg32(mb_bit, priv->base + IMXRT_CAN_IFLAG1_OFFSET);
#ifdef CONFIG_NET_CAN_RAW_TX_DEADLINE
  txmb = mbi - (RXMBCOUNT + 1);
#endif

