apache/nuttx/arch/arm/src/imxrt/imxrt_flexcan.c
static void imxrt_flexcan_interrupt_work(void *arg)
{
  struct imxrt_driver_s *priv = (struct imxrt_driver_s *)arg;

  uint32_t flags;

  flags  = getreg32(priv->base + IMXRT_CAN_IFLAG1_OFFSET);
  flags &= IFLAG1_RX;

  net_lock();
  imxrt_receive(priv, flags);
  net_unlock();

  /* Mask MB again */

  modifyreg32(priv->base + IMXRT_CAN_IMASK1_OFFSET, 0, IFLAG1_RX);
}

/****************************************************************************
 * Function: imxrt_flexcan_interrupt
 *
 * Description:
 *   Three interrupt sources will vector this this function:
 *   1. CAN MB transmit interrupt handler
 *   2. CAN MB receive interrupt handler
 *   3.
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info (architecture-specific)
 *
 * Returned Value:
 *   OK on success
 *
 * Assumptions:
 *
 ****************************************************************************/

static int imxrt_flexcan_interrupt(int irq, void *context,
                                     void *arg)
{
  struct imxrt_driver_s *priv = (struct imxrt_driver_s *)arg;

  if (irq == priv->config->irq)
    {
      uint32_t flags;

      flags  = getreg32(priv->base + IMXRT_CAN_IFLAG1_OFFSET);
      flags &= IFLAG1_RX;

      if (flags)
        {
          modifyreg32(priv->base + IMXRT_CAN_IMASK1_OFFSET, IFLAG1_RX, 0);
          work_queue(CANRCVWORK, &priv->rcvwork,
                     imxrt_flexcan_interrupt_work, priv, 0);
        }

      flags  = getreg32(priv->base + IMXRT_CAN_IFLAG1_OFFSET);
      flags &= IFLAG1_TX;

      if (flags)
        {
          /* Disable further TX MB CAN interrupts. here can be no race
           * condition here.
           */

          modifyreg32(priv->base + IMXRT_CAN_IMASK1_OFFSET, IFLAG1_TX, 0);
          work_queue(CANWORK, &priv->irqwork, imxrt_txdone_work, priv, 0);
        }
    }

  return OK;
}

/****************************************************************************
 * Function: imxrt_txtimeout_work
 *
 * Description:
 *   Perform TX timeout related work from the worker thread
 *
 * Input Parameters:
 *   arg - The argument passed when work_queue() as called.
 *
 * Returned Value:
 *   OK on success
 *
 * Assumptions:
 *
 ****************************************************************************/
#ifdef TX_TIMEOUT_WQ

static void imxrt_txtimeout_work(void *arg)
{
  struct imxrt_driver_s *priv = (struct imxrt_driver_s *)arg;
  uint32_t flags;
  uint32_t mbi;
  uint32_t mb_bit;

  struct timespec ts;
  struct timeval now;

  clock_systime_timespec(&ts);
  now.tv_sec  = ts.tv_sec;
  now.tv_usec = ts.tv_nsec / 1000;

  /* The watchdog timed out, yet we still check mailboxes in case the
   * transmit function transmitted a new frame
   */

  flags  = getreg32(priv->base + IMXRT_CAN_IFLAG1_OFFSET);

  for (mbi = 0; mbi < TXMBRINGSIZE; mbi++)
    {
      struct timeval *deadline = &priv->txmb[mbi].deadline;
      struct mb_s *mb;

      /* imxrt_txdone() zeroes the deadline of a mailbox it has retired, so a
       * non-zero deadline here means the mailbox still holds a frame.
       */

      if (deadline->tv_sec == 0 && deadline->tv_usec == 0)
        {
          continue;
        }

      if (now.tv_sec < deadline->tv_sec
          || (now.tv_sec == deadline->tv_sec
              && now.tv_usec <= deadline->tv_usec))
        {
          continue;
        }

      NETDEV_TXTIMEOUTS(&priv->dev);

      /* imxrt_transmit() stores the deadline of mailbox RXMBCOUNT + 1 + mbi
       * in txmb[mbi]; the mailbox this loop aborts has to match.
       */

      mb_bit = 1 << (RXMBCOUNT + 1 + mbi);

      if (flags & mb_bit)
        {
          putreg32(mb_bit, priv->base + IMXRT_CAN_IFLAG1_OFFSET);
        }

      mb = flexcan_get_mb(priv, RXMBCOUNT + 1 + mbi);
      mb->cs.code = CAN_TXMB_ABORT;
      priv->txmb[mbi].pending = TX_ABORT;
    }
}

/****************************************************************************
 * Function: imxrt_txtimeout_expiry
 *
 * Description:
 *   Our TX watchdog timed out.  Called from the timer interrupt handler.
 *   The last TX never completed.  Reset the hardware and start again.
 *
 * Input Parameters:
 *   arg  - The argument
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Global interrupts are disabled by the watchdog logic.
 *
 ****************************************************************************/

static void imxrt_txtimeout_expiry(wdparm_t arg)
{
  struct imxrt_driver_s *priv = (struct imxrt_driver_s *)arg;

  /* Schedule to perform the TX timeout processing on the worker thread
   */

  work_queue(CANWORK, &priv->irqwork, imxrt_txtimeout_work, priv, 0);
}

#endif

static void imxrt_setenable(uint32_t base, uint32_t enable)
{
  uint32_t regval;

  if (enable)
    {
      regval  = getreg32(base + IMXRT_CAN_MCR_OFFSET);
      regval &= ~(CAN_MCR_MDIS);
      putreg32(regval, base + IMXRT_CAN_MCR_OFFSET);
    }
  else
    {
      regval  = getreg32(base + IMXRT_CAN_MCR_OFFSET);
      regval |= CAN_MCR_MDIS;
      putreg32(regval, base + IMXRT_CAN_MCR_OFFSET);
    }

  imxrt_waitmcr_change(base, CAN_MCR_LPMACK, 1);
}

static void imxrt_setfreeze(uint32_t base, uint32_t freeze)
{
  uint32_t regval;

  if (freeze)
    {
      /* Enter freeze mode */

      regval  = getreg32(base + IMXRT_CAN_MCR_OFFSET);
      regval |= (CAN_MCR_HALT | CAN_MCR_FRZ);
      putreg32(regval, base + IMXRT_CAN_MCR_OFFSET);
    }
  else
    {
      /* Exit freeze mode */

      regval  = getreg32(base + IMXRT_CAN_MCR_OFFSET);
      regval &= ~(CAN_MCR_HALT | CAN_MCR_FRZ);
      putreg32(regval, base + IMXRT_CAN_MCR_OFFSET);
    }
}

static uint32_t imxrt_waitmcr_change(uint32_t base, uint32_t mask,
                                       uint32_t target_state)
{
  const uint32_t timeout = 1000;
  uint32_t wait_ack;

  for (wait_ack = 0; wait_ack < timeout; wait_ack++)
    {
      const bool state = (getreg32(base + IMXRT_CAN_MCR_OFFSET) & mask)
          != 0;

      if (state == target_state)
        {
          return true;
        }

