apache/nuttx/arch/arm/src/imxrt/imxrt_flexcan.c
          if (imxrt_bitratetotimeseg(&arbi_timing, 10, 0))
            {
              ret = OK;
            }
          else
            {
              ret = -EINVAL;
            }

          if (priv->canfd_capable)
            {
              data_timing.bitrate = req->data_bitrate;
              data_timing.samplep = req->data_samplep;

              if (ret == OK && imxrt_bitratetotimeseg(&data_timing, 10, 1))
                {
                  ret = OK;
                }
              else
                {
                  ret = -EINVAL;
                }
            }

          if (ret == OK)
            {
              /* Apply the new timings (interface is guaranteed to be down) */

              priv->arbi_timing = arbi_timing;
              if (priv->canfd_capable)
                {
                  priv->data_timing = data_timing;
                }
            }
        }
        break;
#endif
      default:
        ret = -ENOTTY;
        break;
    }

  return ret;
}
#endif /* CONFIG_NETDEV_IOCTL */

#ifdef CONFIG_IMXRT_FLEXCAN_ECC

/****************************************************************************
 * Function: imxrt_init_eccram
 *
 * Description:
 *   Initialize FLEXCAN ECC RAM
 *
 * Input Parameters:
 *   priv - Reference to the private FLEXCAN driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static int imxrt_init_eccram(struct imxrt_driver_s *priv)
{
  uint32_t i;
  uint32_t regval;
  irqstate_t flags;

  flags = enter_critical_section();

  regval = getreg32(priv->base + IMXRT_CAN_CTRL2_OFFSET);

  /* Set WRMFRZ bit in CTRL2 Register to grant write access to memory */

  regval |= CAN_CTRL2_WRMFRZ;

  putreg32(regval, priv->base + IMXRT_CAN_CTRL2_OFFSET);

  for (i = IMXRT_CAN_MB_OFFSET; i < IMXRT_CAN_MB_END; i += 4)
    {
      putreg32(0, priv->base + i);
    }

  for (i = IMXRT_CAN_MB2_OFFSET; i < IMXRT_CAN_MB2_END; i += 4)
    {
      putreg32(0, priv->base + i);
    }

  regval = getreg32(priv->base + IMXRT_CAN_CTRL2_OFFSET);

  /* Clear WRMFRZ bit in CTRL2 Register */

  regval &= ~CAN_CTRL2_WRMFRZ;

  leave_critical_section(flags);

  return 0;
}

#endif

/****************************************************************************
 * Function: imxrt_initalize
 *
 * Description:
 *   Initialize FLEXCAN device
 *
 * Input Parameters:
 *   priv - Reference to the private FLEXCAN driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static int imxrt_initialize(struct imxrt_driver_s *priv)
{
  uint32_t regval;
  uint32_t i;

  /* initialize CAN device */

  imxrt_setenable(priv->base, 1);

#ifdef CONFIG_IMXRT_FLEXCAN_ECC
  imxrt_init_eccram(priv);
#endif

  imxrt_reset(priv);

  /* Enter freeze mode */

  imxrt_setfreeze(priv->base, 1);
  if (!imxrt_waitfreezeack_change(priv->base, 1))
    {
      nerr("FLEXCAN: freeze fail\n");
      return -1;
    }

  if (!priv->canfd_capable)
    {
      regval  = getreg32(priv->base + IMXRT_CAN_CTRL1_OFFSET);
      regval &= ~(CAN_CTRL1_PRESDIV_MASK | CAN_CTRL1_PROPSEG_MASK |
                  CAN_CTRL1_PSEG1_MASK | CAN_CTRL1_PSEG2_MASK |
                 CAN_CTRL1_RJW_MASK);
      regval |= CAN_CTRL1_PRESDIV(priv->arbi_timing.presdiv) | /* Prescaler divisor factor */
                CAN_CTRL1_PROPSEG(priv->arbi_timing.propseg) | /* Propagation segment */
                CAN_CTRL1_PSEG1(priv->arbi_timing.pseg1) |     /* Phase buffer segment 1 */
                CAN_CTRL1_PSEG2(priv->arbi_timing.pseg2) |     /* Phase buffer segment 2 */
                CAN_CTRL1_RJW(1);                              /* Resynchronization jump width */
      putreg32(regval, priv->base + IMXRT_CAN_CTRL1_OFFSET);
    }
  else
    {
      regval  = getreg32(priv->base + IMXRT_CAN_CBT_OFFSET);
      regval &= ~(CAN_CBT_EPRESDIV_MASK | CAN_CBT_EPROPSEG_MASK |
                  CAN_CBT_EPSEG1_MASK | CAN_CBT_EPSEG2_MASK |
                  CAN_CBT_ERJW_MASK);
      regval |= CAN_CBT_BTF |                                 /* Enable extended bit timing
                                                               * configurations for CAN-FD for setting up
                                                               * separately nominal and data phase */
                CAN_CBT_EPRESDIV(priv->arbi_timing.presdiv) | /* Prescaler divisor factor */
                CAN_CBT_EPROPSEG(priv->arbi_timing.propseg) | /* Propagation segment */
                CAN_CBT_EPSEG1(priv->arbi_timing.pseg1) |     /* Phase buffer segment 1 */
                CAN_CBT_EPSEG2(priv->arbi_timing.pseg2) |     /* Phase buffer segment 2 */
                CAN_CBT_ERJW(1);                              /* Resynchronization jump width */
      putreg32(regval, priv->base + IMXRT_CAN_CBT_OFFSET);

      /* Enable CAN FD feature */

      regval  = getreg32(priv->base + IMXRT_CAN_MCR_OFFSET);
      regval |= CAN_MCR_FDEN;
      putreg32(regval, priv->base + IMXRT_CAN_MCR_OFFSET);

      regval  = getreg32(priv->base + IMXRT_CAN_FDCBT_OFFSET);
      regval &= ~(CAN_FDCBT_FPRESDIV_MASK | CAN_FDCBT_FPROPSEG_MASK |
                  CAN_FDCBT_FPSEG1_MASK | CAN_FDCBT_FPSEG2_MASK |
                 CAN_FDCBT_FRJW_MASK);
      regval |= CAN_FDCBT_FPRESDIV(priv->data_timing.presdiv) |  /* Prescaler divisor factor of 1 */
                CAN_FDCBT_FPROPSEG(priv->data_timing.propseg) |  /* Propagation
                                                                  * segment (only register that doesn't add 1) */
                CAN_FDCBT_FPSEG1(priv->data_timing.pseg1) |      /* Phase buffer segment 1 */
                CAN_FDCBT_FPSEG2(priv->data_timing.pseg2) |      /* Phase buffer segment 2 */
                CAN_FDCBT_FRJW(priv->data_timing.pseg2);         /* Resynchorinzation jump width same as PSEG2 */
      putreg32(regval, priv->base + IMXRT_CAN_FDCBT_OFFSET);

      /* Additional CAN-FD configurations */

      regval  = getreg32(priv->base + IMXRT_CAN_FDCTRL_OFFSET);

      regval |= CAN_FDCTRL_FDRATE |     /* Enable bit rate switch in data phase of frame */
                CAN_FDCTRL_TDCEN |      /* Enable transceiver delay compensation */
                CAN_FDCTRL_TDCOFF(5) |  /* Setup 5 cycles for data phase sampling delay */
                CAN_FDCTRL_MSBSR0(3) |  /* Setup 64 bytes per MB 0-6 */
                CAN_FDCTRL_MSBSR1(3);   /* Setup 64 bytes per MB 7-13 */
      putreg32(regval, priv->base + IMXRT_CAN_FDCTRL_OFFSET);

      regval  = getreg32(priv->base + IMXRT_CAN_CTRL2_OFFSET);
      regval |= CAN_CTRL2_ISOCANFDEN;
      putreg32(regval, priv->base + IMXRT_CAN_CTRL2_OFFSET);
    }

  /*  Errata ER005829 step 7: Reserve first TX MB
   *  Errata mentions writing 0x8 value, but this one causes
   *  the ESR2_LPTM register to choose the reserved MB for
   *  transmitting the package, hence we write 0x3.
   */

  struct mb_s *buffer = flexcan_get_mb(priv, RXMBCOUNT);

  buffer->cs.code = 0x3;

