apache/nuttx/arch/arm/src/imxrt/imxrt_flexcan.c
  for (i = RXMBCOUNT + 1; i < TOTALMBCOUNT; i++)
    {
      struct mb_s *rx = flexcan_get_mb(priv, i);

      rx->id.w = 0x0;

      /* FIXME sometimes we get a hard fault here */
    }

  putreg32(0x0, priv->base + IMXRT_CAN_RXFGMASK_OFFSET);

  for (i = 0; i < TOTALMBCOUNT; i++)
    {
      putreg32(0, priv->base + IMXRT_CAN_RXIMR_OFFSET(i));
    }

  for (i = 0; i < RXMBCOUNT; i++)
    {
      struct mb_s *rx = flexcan_get_mb(priv, i);

      ninfo("Set MB%" PRIi32 " to receive %p\n", i, rx);
      rx->cs.edl = 0x1;
      rx->cs.brs = 0x1;
      rx->cs.esi = 0x0;
      rx->cs.code = 4;
      rx->cs.srr = 0x0;
      rx->cs.ide = 0x1;
      rx->cs.rtr = 0x0;
    }

  putreg32(IFLAG1_RX, priv->base + IMXRT_CAN_IFLAG1_OFFSET);
  putreg32(IFLAG1_RX, priv->base + IMXRT_CAN_IMASK1_OFFSET);

  /* Exit freeze mode */

  imxrt_setfreeze(priv->base, 0);
  if (!imxrt_waitfreezeack_change(priv->base, 0))
    {
      nerr("FLEXCAN: unfreeze fail\n");
      return -1;
    }

  return 1;
}

/****************************************************************************
 * Function: imxrt_reset
 *
 * Description:
 *   Put the EMAC in the non-operational, reset state
 *
 * Input Parameters:
 *   priv - Reference to the private FLEXCAN driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static void imxrt_reset(struct imxrt_driver_s *priv)
{
  uint32_t regval;
  uint32_t i;

  regval  = getreg32(priv->base + IMXRT_CAN_MCR_OFFSET);
  regval |= CAN_MCR_SOFTRST;
  putreg32(regval, priv->base + IMXRT_CAN_MCR_OFFSET);

  if (!imxrt_waitmcr_change(priv->base, CAN_MCR_SOFTRST, 0))
    {
      nerr("Reset failed");
      return;
    }

  regval  = getreg32(priv->base + IMXRT_CAN_MCR_OFFSET);
  regval &= ~(CAN_MCR_SUPV);
  putreg32(regval, priv->base + IMXRT_CAN_MCR_OFFSET);

  /* Initialize all MB rx and tx */

  for (i = 0; i < TOTALMBCOUNT; i++)
    {
      struct mb_s *rx = flexcan_get_mb(priv, i);

      ninfo("MB %" PRIi32 " %p\n", i, rx);
      ninfo("MB %" PRIi32 " %p\n", i, &rx->id.w);
      rx->cs.cs = 0x0;
      rx->id.w = 0x0;
      rx->data[0].w00 = 0x0;
      rx->data[1].w00 = 0x0;
    }

  regval  = getreg32(priv->base + IMXRT_CAN_MCR_OFFSET);
  regval &= ~CAN_MCR_MAXMB_MASK; /* Zero MAXMB to ensure "bitwise or"
                                  * below sets the correct value.
                                  */
  regval |= CAN_MCR_SLFWAK | CAN_MCR_WRNEN | CAN_MCR_SRXDIS |
            CAN_MCR_IRMQ | CAN_MCR_AEN |
            (((TOTALMBCOUNT - 1) << CAN_MCR_MAXMB_SHIFT) &
            CAN_MCR_MAXMB_MASK);
  putreg32(regval, priv->base + IMXRT_CAN_MCR_OFFSET);

  regval  = CAN_CTRL2_RRS | CAN_CTRL2_EACEN;
  putreg32(regval, priv->base + IMXRT_CAN_CTRL2_OFFSET);

  for (i = 0; i < TOTALMBCOUNT; i++)
    {
      putreg32(0, priv->base + IMXRT_CAN_RXIMR_OFFSET(i));
    }

  /* Filtering catchall */

  putreg32(0x3fffffff, priv->base + IMXRT_CAN_RX14MASK_OFFSET);
  putreg32(0x3fffffff, priv->base + IMXRT_CAN_RX15MASK_OFFSET);
  putreg32(0x3fffffff, priv->base + IMXRT_CAN_RXMGMASK_OFFSET);
  putreg32(0x0, priv->base + IMXRT_CAN_RXFGMASK_OFFSET);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Function: imxrt_caninitialize
 *
 * Description:
 *   Initialize the CAN controller and driver
 *
 * Input Parameters:
 *   intf - In the case where there are multiple CAN, this value
 *          identifies which CAN is to be initialized.
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

int imxrt_caninitialize(int intf)
{
  struct imxrt_driver_s *priv;
  int ret;

  switch (intf)
    {
#ifdef CONFIG_IMXRT_FLEXCAN1
      case 1:
        imxrt_clockall_can1();
        imxrt_clockall_can1_serial();
        priv               = &g_flexcan1;
        memset(priv, 0, sizeof(struct imxrt_driver_s));
        priv->base         = IMXRT_CAN1_BASE;
        priv->config       = &imxrt_flexcan1_config;
#  if defined(CONFIG_NET_CAN_CANFD) && defined(CONFIG_IMXRT_FLEXCAN1_FD)
        priv->canfd_capable = true;
        priv->mb_address_offset = 14;
#  else
        priv->canfd_capable = false;
        priv->mb_address_offset = 0;
#  endif

        /* Default bitrate configuration */

#  if defined(CONFIG_NET_CAN_CANFD) && defined(CONFIG_IMXRT_FLEXCAN1_FD)
        priv->arbi_timing.bitrate = CONFIG_FLEXCAN1_ARBI_BITRATE;
        priv->arbi_timing.samplep = CONFIG_FLEXCAN1_ARBI_SAMPLEP;
        priv->data_timing.bitrate = CONFIG_FLEXCAN1_DATA_BITRATE;
        priv->data_timing.samplep = CONFIG_FLEXCAN1_DATA_SAMPLEP;
#  else
        priv->arbi_timing.bitrate = CONFIG_FLEXCAN1_BITRATE;
        priv->arbi_timing.samplep = CONFIG_FLEXCAN1_SAMPLEP;
#  endif
        break;
#endif

#ifdef CONFIG_IMXRT_FLEXCAN2
      case 2:
        imxrt_clockall_can2();
        imxrt_clockall_can2_serial();
        priv         = &g_flexcan2;
        memset(priv, 0, sizeof(struct imxrt_driver_s));
        priv->base   = IMXRT_CAN2_BASE;
        priv->config = &imxrt_flexcan2_config;
#  if defined(CONFIG_NET_CAN_CANFD) && defined(CONFIG_IMXRT_FLEXCAN2_FD)
        priv->canfd_capable = true;
        priv->mb_address_offset = 14;
#  else
        priv->canfd_capable = false;
        priv->mb_address_offset = 0;
#  endif

        /* Default bitrate configuration */

#  if defined(CONFIG_NET_CAN_CANFD) && defined(CONFIG_IMXRT_FLEXCAN2_FD)
        priv->arbi_timing.bitrate = CONFIG_FLEXCAN2_ARBI_BITRATE;
        priv->arbi_timing.samplep = CONFIG_FLEXCAN2_ARBI_SAMPLEP;
        priv->data_timing.bitrate = CONFIG_FLEXCAN2_DATA_BITRATE;
        priv->data_timing.samplep = CONFIG_FLEXCAN2_DATA_SAMPLEP;
#  else
        priv->arbi_timing.bitrate = CONFIG_FLEXCAN2_BITRATE;
        priv->arbi_timing.samplep = CONFIG_FLEXCAN2_SAMPLEP;
#  endif
        break;
#endif

#ifdef CONFIG_IMXRT_FLEXCAN3
      case 3:
        imxrt_clockall_can3();
        imxrt_clockall_can3_serial();
        priv         = &g_flexcan3;
        memset(priv, 0, sizeof(struct imxrt_driver_s));
        priv->base   = IMXRT_CAN3_BASE;
        priv->config = &imxrt_flexcan3_config;
#  ifdef CONFIG_NET_CAN_CANFD
        priv->canfd_capable = true;
        priv->mb_address_offset = 14;
#  else
        priv->canfd_capable = false;
        priv->mb_address_offset = 0;
#  endif

        /* Default bitrate configuration */

#  ifdef CONFIG_NET_CAN_CANFD
        priv->arbi_timing.bitrate = CONFIG_FLEXCAN3_ARBI_BITRATE;
        priv->arbi_timing.samplep = CONFIG_FLEXCAN3_ARBI_SAMPLEP;
        priv->data_timing.bitrate = CONFIG_FLEXCAN3_DATA_BITRATE;
        priv->data_timing.samplep = CONFIG_FLEXCAN3_DATA_SAMPLEP;
#  else
        priv->arbi_timing.bitrate = CONFIG_FLEXCAN3_BITRATE;
        priv->arbi_timing.samplep = CONFIG_FLEXCAN3_SAMPLEP;
#  endif
        break;
#endif

      default:
        return -ENODEV;
    }

