apache/nuttx/arch/arm/src/imxrt/imxrt_flexcan.c
  if (!imxrt_bitratetotimeseg(&priv->arbi_timing, 1, 0))
    {
      nerr("ERROR: Invalid CAN timings please try another sample point "
           "or refer to the reference manual\n");
      return -1;
    }

  if (priv->canfd_capable)
    {
      if (!imxrt_bitratetotimeseg(&priv->data_timing, 1, 1))
        {
          nerr("ERROR: Invalid CAN data phase timings please try another "
               "sample point or refer to the reference manual\n");
          return -1;
        }
    }

  imxrt_config_gpio(priv->config->tx_pin);
  imxrt_config_gpio(priv->config->rx_pin);

  if (irq_attach(priv->config->irq, imxrt_flexcan_interrupt, priv))
    {
      /* We could not attach the ISR to the interrupt */

      nerr("ERROR: Failed to attach CAN bus IRQ\n");
      return -EAGAIN;
    }

  /* Initialize the driver structure */

  priv->dev.d_ifup    = imxrt_ifup;      /* I/F up (new IP address) callback */
  priv->dev.d_ifdown  = imxrt_ifdown;    /* I/F down callback */
  priv->dev.d_txavail = imxrt_txavail;   /* New TX data callback */
#ifdef CONFIG_NETDEV_IOCTL
  priv->dev.d_ioctl   = imxrt_ioctl;     /* Support CAN ioctl() calls */
#endif
  priv->dev.d_private = (void *)priv;      /* Used to recover private state from dev */
  spin_lock_init(&priv->lock);

  /* Put the interface in the down state.  This usually amounts to resetting
   * the device and/or calling imxrt_ifdown().
   */

  ninfo("callbacks done\n");

  imxrt_ifdown(&priv->dev);

  /* Register the device with the OS so that socket IOCTLs can be performed */

  netdev_register(&priv->dev, NET_LL_CAN);

  UNUSED(ret);
  return OK;
}

/****************************************************************************
 * Name: arm_caninitialize
 *
 * Description:
 *   Initialize the first network interface.  If there are more than one
 *   interface in the chip, then board-specific logic will have to provide
 *   this function to determine which, if any, Ethernet controllers should
 *   be initialized.
 *
 ****************************************************************************/

#if !defined(CONFIG_NETDEV_LATEINIT)
void arm_netinitialize(void)
{
#ifdef CONFIG_IMXRT_FLEXCAN1
  imxrt_caninitialize(1);
#endif

#ifdef CONFIG_IMXRT_FLEXCAN2
  imxrt_caninitialize(2);
#endif

#ifdef CONFIG_IMXRT_FLEXCAN3
  imxrt_caninitialize(3);
#endif
}
#endif

#endif /* CONFIG_IMXRT_FLEXCAN */
